app/controllers/firms_controller.rb

  def create
    @firm = Firm.new(firm_params)

    respond_to do |format|
      if @firm.save
---
INSERT INTO "firms" ("created_at", "email", "firm_legal_name", "firm_short_name", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?)

    def set_firm
      @firm = Firm.find(params[:id])
---
SELECT "firms".* FROM "firms" WHERE "firms"."id" = ? LIMIT 1  [["id", "1"]]